app/views/teams/show.html.erb

    <h2>Batters</h2>
        <% @team.batters.each do |b| %>
---
SELECT "batters".* FROM "batters" WHERE "batters"."batter_id" = ?  [["batter_id", 136]]

    <h2>Pitchers</h2>
        <% @team.pitchers.each do |p| %>
---
SELECT "pitchers".* FROM "pitchers" WHERE "pitchers"."team_id" = ?  [["team_id", 55]]