app/views/batters/_form.erb

    <p><%= f.label 'Batter Team:'%></p>
    <%= f.collection_select(:team_id, Team.all, :id, :name) %><br>
---
SELECT "teams".* FROM "teams"