app/controllers/batters_controller.rb

  def index
    @batters = Batter.all
---
SELECT "batters".* FROM "batters"

  def show
    @batter = Batter.find(params[:id])
---
SELECT  "batters".* FROM "batters" WHERE "batters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @batter = Batter.find(params[:id])
---
SELECT  "batters".* FROM "batters" WHERE "batters"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @batter = Batter.create(batter_params(:name, :tier))
---
INSERT INTO "batters" ("name", "tier", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Mike Trout"], ["tier", 1], ["created_at", "2020-12-14 19:29:48.040642"], ["updated_at", "2020-12-14 19:29:48.040642"]]

  def update
    @batter = Batter.find(params[:id])
    @batter.update(batter_params(:name, :tier))
---
SELECT  "batters".* FROM "batters" WHERE "batters"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "batters" SET "tier" = ?, "updated_at" = ? WHERE "batters"."id" = ?  [["tier", 3], ["updated_at", "2020-12-14 22:30:07.234160"], ["id", 5]]