app/controllers/pitchers_controller.rb

  def index
    @pitchers = Pitcher.all
---
SELECT "pitchers".* FROM "pitchers"

  def show
    @pitcher = Pitcher.find(params[:id])
---
SELECT  "pitchers".* FROM "pitchers" WHERE "pitchers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @pitcher = Pitcher.create(pitcher_params(:name, :tier))
---
INSERT INTO "pitchers" ("name", "tier", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Rick Honeycutt"], ["tier", 3], ["created_at", "2020-12-14 19:40:14.450648"], ["updated_at", "2020-12-14 19:40:14.450648"]]