app/controllers/plate_appearances_controller.rb

SELECT "plate_appearances".* FROM "plate_appearances"
---
  def index
    @plate_appearances = PlateAppearance.all

SELECT  "plate_appearances".* FROM "plate_appearances" WHERE "plate_appearances"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @plate_appearance = PlateAppearance.find(params[:id])

INSERT INTO "batters" ("name", "tier", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Kurt Abbott"], ["tier", 3], ["created_at", "2020-12-15 04:32:38.459688"], ["updated_at", "2020-12-15 04:32:38.459688"]]
INSERT INTO "pitchers" ("name", "tier", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Fernando Abad"], ["tier", 3], ["created_at", "2020-12-15 04:32:38.457219"], ["updated_at", "2020-12-15 04:32:38.457219"]]
INSERT INTO "plate_appearances" ("batter_id", "pitcher_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["batter_id", 2], ["pitcher_id", 2], ["created_at", "2020-12-14 19:49:19.441774"], ["updated_at", "2020-12-14 19:49:19.441774"]]
---
  def create
    @plate_appearance = PlateAppearance.create(plate_appearance_params(:batter_id, :pitcher_id))