app/views/plate_appearances/new.html.erb

SELECT "batters".* FROM "batters"
---
    <%= f.label 'Batter:'%>
    <%= f.collection_select(:batter_id, Batter.all, :id, :name) %>

SELECT "pitchers".* FROM "pitchers"
---
    <%= f.label 'Pitcher:'%>
    <%= f.collection_select(:pitcher_id, Pitcher.all, :id, :name) %>